// Задача2. Необходимо написать программу, которая выводит случайное трехзначное число и удаляет вторую цифру этого числа. 
// И как результат выводит двузначное число. 

int Number()
{
    int rand = new Random().Next(100, 1000);
    Console.WriteLine("Current random number is " + rand);

    int sot = rand / 100;
    int dec = rand / 10;
    int ed = rand % 10;

    return sot * 10 + ed;

}

int num = Number();
Console.WriteLine("Result " + num);


















// Задача 3. Написать программу, которая будет принимать на вход 2 числа и выводить явлется ли второе число кратно первому. 
// Если не кратно, то выводит остаток от деление. (Делать через void).

// Задача 4. Написать программу, которая принимает на вход число и проверяет кратно ли оно 7-ми и 23-м. 
// (Делать через bool)

